{"resposta1":"Ao digitar o endereço na barra de endereços o computador fará uma consulta no servidor DNS, a fim de descobrir o endereço IP do domínio\/subdomínio informado. Após descoberto o endereço IP do servidor onde a página está hospedada, o navegador fará uma requisição HTTP ou HTTPS (geralmente na porta TCP\/80 ou TCP\/443) nesse IP e o servidor HTTP enviará o conteúdo dessa página de volta para o navegador do cliente, que exibirá ao usuário a página.","resposta2amaster":"ns1.ecomt4.com.br","resposta2aslave":"ns2.ecomt4.com.br","resposta2b":"Como o domínio não está registrado ainda, não foi possível descobrir o servidor DNS autoritativo com o nslookup. Dessa forma utilizei o comando dig para cada um dos servidores DNS da lista, segue um exemplo: dig @ns2.ecomt4.com.br +nssearch olatray.com.br\r\n\r\nApenas os dois servidores, informados na pergunta A, retornaram as informações referentes ao domínio olatray.com.br e em ambos os casos o SOA era o ns1.ecomt4.com.br, dessa forma foi possível deduzir que ns1.ecomt4.com.br é o master e o ns2.ecomt4.com.br o slave.","resposta3":"O destinatário da mensagem não existe, porém o servidor de email está ok. Pode ter havido um erro de digitação por parte de usuário ou a caixa postal foi removida ou renomeada.","resposta4a":"98732.tcdn.com.br","resposta4b":"177.67.118.70","resposta4c":"Com o comando nslookup nos dois domínios informados no enunciado foi possível compreender que o CNAME é composto pelo ID mais .tcdn.com.br. Para descobrir o apontamento A foi necessário consultar o nameserver ns1.ecomt4.com.br, com o comando dig A @ns1.ecomt4.com.br www.olatray.com.br","resposta5":"Há diversas ferramentas e possibilidades, de acordo com a necessidade ou métricas (latência, disponibilidade etc.) desejadas. Eu utilizo o Nagios, pois é uma ferramenta muito flexível e que já vem com uma gama de scripts prontos para monitorar a aplicação. E ainda é possível desenvolver seu próprio script e integrá-lo ao Nagios.","resposta6":"O servidor entrará no console de recuperação do grub, devido à remoção de arquivos importantes para a inicialização e funcionamento do sistema operacional."}